src/Documents/РасчетСебестоимостиВыпуска/РасчетСебестоимостиВыпуска.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РасчетСебестоимостиВыпуска</name>
  <comment>(Общ)</comment>
  <registerRecords>AccumulationRegister.КорректировкиНезавершенноеПроизводствоНалоговыйУчет</registerRecords>
  <registerRecords>InformationRegister.НоменклатураИсключаемаяИзБазыРаспределения</registerRecords>
  <registerRecords>AccumulationRegister.НезавершенноеПроизводство</registerRecords>
  <registerRecords>AccumulationRegister.БракВПроизводстве</registerRecords>
  <registerRecords>InformationRegister.БазаРаспределенияЗатратМеждународныйУчет</registerRecords>
  <registerRecords>InformationRegister.РаспределениеПродукцииПоПеределамОрганизаций</registerRecords>
  <registerRecords>AccumulationRegister.КорректировкиСтроительствоОбъектовОсновныхСредствНалоговыйУчет</registerRecords>
  <registerRecords>AccumulationRegister.ПартииТоваровНаСкладахБухгалтерскийУчет</registerRecords>
  <registerRecords>AccumulationRegister.УДАЛИТЬБракВПроизводствеНалоговыйУчет</registerRecords>
  <registerRecords>AccumulationRegister.ЗатратыМеждународныйУчет</registerRecords>
  <registerRecords>AccumulationRegister.УчетЗатрат</registerRecords>
  <registerRecords>AccumulationRegister.ПартииТоваровНаСкладахМеждународныйУчет</registerRecords>
  <registerRecords>InformationRegister.БазаРаспределенияЗатратБухгалтерскийУчет</registerRecords>
  <registerRecords>AccumulationRegister.БракВПроизводствеМеждународныйУчет</registerRecords>
  <registerRecords>InformationRegister.БазаРаспределенияЗатрат</registerRecords>
  <registerRecords>InformationRegister.УДАЛИТЬБазаРаспределенияЗатратНалоговыйУчет</registerRecords>
  <registerRecords>AccumulationRegister.ВыпускПродукции</registerRecords>
  <registerRecords>AccumulationRegister.НезавершенноеПроизводствоМеждународныйУчет</registerRecords>
  <registerRecords>AccumulationRegister.СтоимостьОС</registerRecords>
  <registerRecords>InformationRegister.ПервоначальныеСведенияОСБухгалтерскийУчет</registerRecords>
  <registerRecords>InformationRegister.КорректировкаВстречногоВыпускаПродукции</registerRecords>
  <registerRecords>AccumulationRegister.ЗатратыНаВыпускПродукцииМеждународныйУчет</registerRecords>
  <registerRecords>AccumulationRegister.КорректировкиБракВПроизводствеНалоговыйУчет</registerRecords>
  <registerRecords>AccumulationRegister.ПартииТоваровПереданные</registerRecords>
  <registerRecords>AccumulationRegister.КорректировкиЗатратыНалоговыйУчет</registerRecords>
  <registerRecords>AccumulationRegister.КорректировкиПартииТоваровНалоговыйУчет</registerRecords>
  <registerRecords>AccumulationRegister.УДАЛИТЬЗатратыНаВыпускПродукцииНалоговыйУчет</registerRecords>
  <registerRecords>AccumulationRegister.ВыпускПродукцииБухгалтерскийУчет</registerRecords>
  <registerRecords>InformationRegister.НоменклатураИсключаемаяИзБазыРаспределенияОрганизаций</registerRecords>
  <registerRecords>AccumulationRegister.ПартииТоваровНаСкладах</registerRecords>
  <registerRecords>AccumulationRegister.ЗатратыНаВыпускПродукцииНаработкаБухгалтерскийУчет</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>AccumulationRegister.УДАЛИТЬПартииМатериаловВЭксплуатацииНалоговыйУчет</registerRecords>
  <registerRecords>AccumulationRegister.БракВПроизводствеБухгалтерскийУчет</registerRecords>
  <registerRecords>InformationRegister.ПараметрыАмортизацииОСБухгалтерскийУчет</registerRecords>
  <registerRecords>AccumulationRegister.СтоимостьОСБухгалтерскийУчет</registerRecords>
  <registerRecords>AccumulationRegister.УчетЗатратРегл</registerRecords>
  <registerRecords>AccumulationRegister.ПартииТоваровПереданныеМеждународныйУчет</registerRecords>
  <registerRecords>AccountingRegister.Международный</registerRecords>
  <registerRecords>AccumulationRegister.ЗатратыНаСтроительствоОбъектовОсновныхСредств</registerRecords>
  <registerRecords>AccumulationRegister.УДАЛИТЬПартииТоваровПереданныеНалоговыйУчет</registerRecords>
  <registerRecords>AccumulationRegister.ПартииМатериаловВЭксплуатации</registerRecords>
  <registerRecords>AccumulationRegister.ЗатратыОбороты</registerRecords>
  <registerRecords>AccumulationRegister.ПартииТоваровПереданныеБухгалтерскийУчет</registerRecords>
  <registerRecords>InformationRegister.РаспределениеПродукцииПоПеределам</registerRecords>
  <registerRecords>AccumulationRegister.ЗатратыНаВыпускПродукции</registerRecords>
  <registerRecords>AccumulationRegister.УДАЛИТЬПартииТоваровНаСкладахНалоговыйУчет</registerRecords>
  <registerRecords>AccumulationRegister.СтроительствоОбъектовОсновныхСредств</registerRecords>
  <registerRecords>AccumulationRegister.УДАЛИТЬВыпускПродукцииНалоговыйУчет</registerRecords>
  <registerRecords>AccumulationRegister.УчетПродажИСебестоимости</registerRecords>
  <registerRecords>InformationRegister.ПервоначальныеСведенияОСНалоговыйУчет</registerRecords>
  <registerRecords>InformationRegister.РаспределениеЗатратПоПеределам</registerRecords>
  <registerRecords>AccumulationRegister.УДАЛИТЬНезавершенноеПроизводствоНалоговыйУчет</registerRecords>
  <registerRecords>AccumulationRegister.НезавершенноеПроизводствоБухгалтерскийУчет</registerRecords>
  <registerRecords>AccumulationRegister.ПартииМатериаловВЭксплуатацииБухгалтерскийУчет</registerRecords>
  <registerRecords>AccumulationRegister.ВыпускПродукцииМеждународныйУчет</registerRecords>
  <registerRecords>AccumulationRegister.СтроительствоОбъектовОсновныхСредствБухгалтерскийУчет</registerRecords>
  <registerRecords>AccumulationRegister.ПродажиСебестоимость</registerRecords>
  <registerRecords>AccumulationRegister.Затраты</registerRecords>
  <registerRecords>AccumulationRegister.УДАЛИТЬЗатратыНалоговыйУчет</registerRecords>
  <registerRecords>AccumulationRegister.ЗатратыНаВыпускПродукцииБухгалтерскийУчет</registerRecords>
  <registerRecords>InformationRegister.ПараметрыАмортизацииОСНалоговыйУчет</registerRecords>
  <registerRecords>InformationRegister.ПервоначальныеСведенияОС</registerRecords>
  <registerRecords>AccountingRegister.Налоговый</registerRecords>
  <registerRecords>InformationRegister.УзлыКорректировкиСтоимостиСписания</registerRecords>
  <registerRecords>AccumulationRegister.ЗатратыНаВыпускПродукцииНаработка</registerRecords>
  <registerRecords>InformationRegister.УДАЛИТЬРаспределениеВыпускаБухгалтерскийУчетНаВыпускНалоговыйУчет</registerRecords>
  <registerRecords>InformationRegister.РаспределениеЗатратПоПеределамОрганизаций</registerRecords>
  <registerRecords>InformationRegister.ПараметрыАмортизацииОС</registerRecords>
  <registerRecords>AccumulationRegister.ЗатратыБухгалтерскийУчет</registerRecords>
  <registerRecords>AccumulationRegister.ПартииМатериаловВЭксплуатацииМеждународныйУчет</registerRecords>
  <registerRecords>AccumulationRegister.ПродажиСебестоимостьБухгалтерскийУчет</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <comment>(Общ) Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтражатьВБухгалтерскомУчете</name>
    <comment>(Общ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтражатьВМеждународномУчете</name>
    <comment>(Общ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтражатьВУправленческомУчете</name>
    <comment>(Общ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодРегистрации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьОбщепроизводственныеРасходыПриРаспределенииПоПеределам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УДАЛИТЬОтражатьВНалоговомУчете</name>
    <comment>(Общ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВыполняемыеДействия</name>
    <comment>(Общ)</comment>
    <attributes>
      <name>ВыполняемоеДействие</name>
      <comment>(Общ)</comment>
      <type>
        <types>EnumRef.ВыполняемыеОперацииРасчетСебестоимостиВыпуска</types>
      </type>
    </attributes>
    <attributes>
      <name>Выполнять</name>
      <comment>(Общ)</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/AccumulationRegisters/ВыпускПродукции/ВыпускПродукции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВыпускПродукции</name>
  <comment>(Упр)</comment>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоДоделка</name>
    <comment>(Общ)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Стоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>КодОперации</name>
    <type>
      <types>EnumRef.КодыОперацийВыпускПродукции</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеПолучатель</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказПолучатель</name>
    <type>
      <types>DocumentRef.ЗаказНаПроизводство</types>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяЗатратПолучатель</name>
    <type>
      <types>CatalogRef.СтатьиЗатрат</types>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатурнаяГруппаПолучатель</name>
    <type>
      <types>CatalogRef.НоменклатурныеГруппы</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладПолучатель</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяЗатратПоВозврату</name>
    <type>
      <types>CatalogRef.СтатьиЗатрат</types>
    </type>
  </attributes>
  <attributes>
    <name>ПродукцияПолучатель</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ХарактеристикаПродукцииПолучатель</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>СерияПродукцииПолучатель</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусПартии</name>
    <type>
      <types>EnumRef.СтатусыПартийТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантВыпускаПродукции</name>
    <type>
      <types>EnumRef.ВариантыВыпускаПродукции</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектСтроительства</name>
    <type>
      <types>CatalogRef.ОбъектыСтроительства</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерСтрокиДокумента</name>
    <comment>Индекс строки документа</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НоменклатурнаяГруппа</name>
    <type>
      <types>CatalogRef.НоменклатурныеГруппы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Продукция</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХарактеристикаПродукции</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СерияПродукции</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Спецификация</name>
    <type>
      <types>CatalogRef.СпецификацииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.ЗаказНаПроизводство</types>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументВыпуска</name>
    <type>
      <types>DocumentRef.АктОбОказанииПроизводственныхУслуг</types>
      <types>DocumentRef.ОтчетПроизводстваЗаСмену</types>
      <types>DocumentRef.СписаниеНЗП</types>
      <types>DocumentRef.ОприходованиеНЗП</types>
      <types>DocumentRef.ПоступлениеТоваровИзПереработки</types>
      <types>DocumentRef.ОприходованиеМатериаловИзПроизводства</types>
      <types>DocumentRef.КомплектацияНоменклатуры</types>
      <types>DocumentRef.КорректировкаНЗП</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Качество</name>
    <type>
      <types>CatalogRef.Качество</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/AccumulationRegisters/ЗатратыНаВыпускПродукцииНаработка/ЗатратыНаВыпускПродукцииНаработка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЗатратыНаВыпускПродукцииНаработка</name>
  <comment>(Упр)</comment>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>КодОперации</name>
    <type>
      <types>EnumRef.КодыОперацийЗатратыНаВыпускПродукции</types>
    </type>
  </attributes>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Продукция</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХарактеристикаПродукции</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.ЗаказНаПроизводство</types>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяЗатрат</name>
    <type>
      <types>CatalogRef.СтатьиЗатрат</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НоменклатурнаяГруппа</name>
    <type>
      <types>CatalogRef.НоменклатурныеГруппы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Затрата</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХарактеристикаЗатраты</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СерияЗатраты</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НоменклатурнаяГруппаНЗП</name>
    <type>
      <types>CatalogRef.НоменклатурныеГруппы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаказНЗП</name>
    <type>
      <types>DocumentRef.ЗаказНаПроизводство</types>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПодразделениеНЗП</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Documents/РасчетСебестоимостиВыпуска/ObjectModule.bsl
Перем мУдалятьДвижения Экспорт;

// Строки, хранят реквизиты имеющие смысл только для бух. учета и упр. соответственно
// в случае если документ не отражается в каком-то виде учета, делаются невидимыми
Перем мСтрокаРеквизитыБухУчета Экспорт;
Перем мСтрокаРеквизитыУпрУчета Экспорт;

Перем мУчетнаяПолитика; // Хранит параметры учетной политики на момент проведения документа
Перем мБазыКоэффициентов; 

Перем мРасчетПоПеределамВспомогательноеПроизводство;
Перем мРасчетПоПеределамОсновноеПроизводство;
Перем мВидыПодразделенийДляРасчетаПоПеределам;
Перем мВидыПодразделенийДляРасчетаПоПодразделениям;
Перем мТекНомПередела;     // Текущий номер передела
Перем мТабПеределовОбщая; // Таблица переделов

// Период построения запросов. равный началу и концу месяца, с включением границ
// Для виртуальных таблиц регистров используются границы,
// для таблиц движений регистров - даты
Перем мНачГраница;
Перем мКонГраница;
Перем мНачДата;
Перем мКонДата;

// Таблицы движений по регистрам
Перем мТаблицаДвиженийВыпуск;   		 // По регистру "ВыпускПродукции"           упр/бух
Перем мТаблицаДвиженийНЗП;   			 // По регистру "НезавершенноеПроизводство" упр/бух
Перем мТаблицаДвиженийЗатраты;           // По регистру "Затраты"                   упр/бух
Перем мТаблицаДвиженийЗатратыОбороты;    // По регистру "Затраты (обороты)"         упр
Перем мТаблицаДвиженийЗатратыНаВыпуск;   // По регистру "ЗатратыНаВыпускПродукции"  упр/бух
Перем мТаблицаДвиженийЗатратыНаВыпускНаработка; // По регистру "ЗатратыНаВыпускПродукцииНаработка"  упр/бух
Перем мТаблицаДвиженийБракВПроизводстве; // По регистру "БракВПроизводстве"  	   упр/бух
Перем мТаблицаДвиженийПартии;			 // По регистру партии товаров на складе
Перем мТаблицаДвиженийПродажиСебестоимость;	// По регитсру "Продажи себестоимость" упр.

// Наборы движений по регистрам
Перем мДвиженияВыпуск;                   // По регистру "ВыпускПродукции"           упр/бух
Перем мДвиженияНЗП;                      // По регистру "НезавершенноеПроизводство" упр/бух
Перем мДвиженияЗатраты;                  // По регистру "Затраты"                   упр/бух
Перем мДвиженияЗатратыОбороты;           // По регистру "Затраты (обороты)"         упр
Перем мДвиженияЗатратыНаВыпуск;          // По регистру "ЗатратыНаВыпускПродукции"  упр/бух
Перем мДвиженияЗатратыНаВыпускНаработка; // По регистру "ЗатратыНаВыпускПродукцииНаработка"  упр/бух
Перем мДвиженияБракВПроизводстве;        // По регистру "БракВПроизводстве"  	   упр/бух
Перем мДвиженияПартии;			         // По регистру партии товаров на складе
Перем мДвиженияПродажиСебестоимость;	 // По регитсру "Продажи себестоимость" упр.
Перем мДвиженияБазаРаспределенияЗатрат;  // По регистру сведений "База распределения затрат" (по всем видам учета)
Перем мОперация;                         // По регистру бухгалтерии "Хозрасчетный"
Перем мСуффиксИмениРегистра;             // Суффикс имени регистра. для бух. учета = "БухгалтерскийУчет"
								         // для упр. учета = "", для налог. учете = "НалоговыйУчет"
Перем мСуффиксСчета;                     // Суффикс счета. для бух. учета = "СчетУчетаБУ"


////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОКУМЕНТА

#Если Клиент Тогда
	
// Процедура осуществляет печать документа. Можно направить печать на 
// экран или принтер, а также распечатать необходимое количество копий.
//
//  Название макета печати передается в качестве параметра,
// по переданному названию находим имя макета в соответствии.
//
// Параметры:
//  НазваниеМакета - строка, название макета.
//
Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь) Экспорт

	Если ЭтоНовый() Тогда
		Предупреждение("Документ можно распечатать только после его записи");
		Возврат;
	ИначеЕсли Не УправлениеДопПравамиПользователей.РазрешитьПечатьНепроведенныхДокументов(Проведен) Тогда
		Предупреждение("Недостаточно полномочий для печати непроведенного документа!");
		Возврат;
	КонецЕсли;

	Если Не РаботаСДиалогами.ПроверитьМодифицированность(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;

	Если ТипЗнч(ИмяМакета) = Тип("ДвоичныеДанные") Тогда

		ТабДокумент = УниверсальныеМеханизмы.НапечататьВнешнююФорму(Ссылка, ИмяМакета);
		
		Если ТабДокумент = Неопределено Тогда
			Возврат
		КонецЕсли; 
		
	КонецЕсли;

	УниверсальныеМеханизмы.НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, ОбщегоНазначения.СформироватьЗаголовокДокумента(ЭтотОбъект), Ссылка);

КонецПроцедуры // Печать

// Возвращает доступные варианты печати документа
//
// Возвращаемое значение:
//  Структура, каждая строка которой соответствует одному из вариантов печати
//  
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	Возврат Новый Структура;

КонецФункции // ПолучитьСтруктуруПечатныхФорм()

#КонецЕсли

// Процедура заполняет структуры именами реквизитов, которые имеют смысл
// только для определенного вида учета
//
Процедура ЗаполнитьСписокРеквизитовЗависимыхОтТиповУчета() Экспорт
	
	мСтрокаРеквизитыБухУчета = "Организация, НадписьОрганизация";
	мСтрокаРеквизитыУпрУчета = "";
	
КонецПроцедуры // ЗаполнитьСписокРеквизитовЗависимыхОтТиповУчета()

// Процедура проверяет правильность заполнения реквизитов документа
//
Процедура ПроверкаРеквизитов(Отказ, Заголовок, СтруктураШапкиДокумента) Экспорт
	
	ЗаполнитьСписокРеквизитовЗависимыхОтТиповУчета();
	
	РеквизитыШапки = "Организация";
	УправлениеЗатратами.НепроверятьРеквизитыПоТипуУчета(ЭтотОбъект, РеквизитыШапки, СтруктураШапкиДокумента, мСтрокаРеквизитыУпрУчета, мСтрокаРеквизитыБухУчета);
	
	ЗаполнениеДокументов.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, Новый Структура(РеквизитыШапки), Отказ, Заголовок);
	
КонецПроцедуры // ПроверкаРеквизитов()

// Процедура проверяет не были ли уже ранее выполенны действия, указанные в документе
//
Процедура ПроверитьСписокДействий(Отказ)
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ДокРасчетСебестоимости.ВыполняемоеДействие КАК Действие,
	|	ДокРасчетСебестоимости.Ссылка
	|ИЗ
	|	Документ.РасчетСебестоимостиВыпуска.ВыполняемыеДействия КАК ДокРасчетСебестоимости
	|ГДЕ
	|	ДокРасчетСебестоимости.Ссылка.Проведен
	|	И ДокРасчетСебестоимости.Ссылка.Ссылка <> &ТекДок
	|	И ДокРасчетСебестоимости.Ссылка.ОтражатьВБухгалтерскомУчете  = &ФлагБухУчет
	|	И ДокРасчетСебестоимости.Ссылка.ОтражатьВМеждународномУчете  = &ФлагМСФО
	|	И ДокРасчетСебестоимости.Ссылка.ОтражатьВУправленческомУчете = &ФлагУпрУчет
	|	И ДокРасчетСебестоимости.Ссылка.ПериодРегистрации            = &МесяцРасчета
	|	И ДокРасчетСебестоимости.ВыполняемоеДействие В(&МассивДействий)";
	
	Запрос = Новый Запрос;
	Если НЕ ОтражатьВУправленческомУчете Тогда
		ТекстЗапроса = ТекстЗапроса + "
		|	И ДокРасчетСебестоимости.Ссылка.Организация = &Орг";
		Запрос.УстановитьПараметр( "Орг", Организация);
	КонецЕсли;
	
	МассивДействий = Новый Массив; // Массив действий которые нельзя выполнять дважды за расчетный период
	Если НЕ ВыполняемыеДействия.Найти( Перечисления.ВыполняемыеОперацииРасчетСебестоимостиВыпуска.РаспределениеПродукцииИЗатратПоПеределам, "ВыполняемоеДействие") = Неопределено Тогда
		МассивДействий.Добавить( Перечисления.ВыполняемыеОперацииРасчетСебестоимостиВыпуска.РаспределениеПродукцииИЗатратПоПеределам);
	КонецЕсли;
	
	Если МассивДействий.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Запрос.УстановитьПараметр( "МассивДействий", МассивДействий);
	Запрос.УстановитьПараметр( "МесяцРасчета",   ПериодРегистрации);
	Запрос.УстановитьПараметр( "ТекДок",         Ссылка);
	Запрос.УстановитьПараметр( "ФлагБухУчет",    ОтражатьВБухгалтерскомУчете);
	Запрос.УстановитьПараметр( "ФлагУпрУчет",    ОтражатьВУправленческомУчете);
	Запрос.УстановитьПараметр( "ФлагМСФО",       ОтражатьВМеждународномУчете);
	
	Запрос.Текст = ТекстЗапроса;
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Отказ = Истина;
#Если Клиент Тогда
		Обход = РезультатЗапроса.Выбрать();
		Пока Обход.Следующий() Цикл
			ОбщегоНазначения.Сообщение("Действие: """ + Обход.Действие + """ в расчетном периоде выполнено документом " + Обход.Ссылка, СтатусСообщения.Внимание);
		КонецЦикла;
#КонецЕсли
	КонецЕсли;
	
КонецПроцедуры // ПроверитьСписокДействий()

// Процедура заполняет табличную часть "Выполняемые действия".
//
Процедура ЗаполнитьВыполняемыеДействия(ПоКнопке = Ложь) Экспорт
	
	ВыполняемыеДействия.Очистить();
	
	МассивДействий = ПроцедурыРасчетаСебестоимостиВыпуска.ПолучитьМассивВыполняемыхДействий(ПериодРегистрации, Организация, ОтражатьВУправленческомУчете, ОтражатьВБухгалтерскомУчете, ПоКнопке);	

	Для Каждого ВыполняемоеДействие Из МассивДействий Цикл
		
		НоваяСтрока = ВыполняемыеДействия.Добавить();
		НоваяСтрока.ВыполняемоеДействие = ВыполняемоеДействие;
		
	КонецЦикла;
		
КонецПроцедуры // ЗаполнитьВыполняемыеДействия()

// Функция получения признака использования расширенной аналитики учета.
//
// Параметры:
//	ПолучитьНовоеЗначение - Булево - признак необходимости получения нового значения параметра
//
// Возвращаемое значение:
//	Булево - признак использования расширенной аналитики учета
//
Функция ПолучитьИспользованиеРасширеннойАналитики(
	ПолучитьНовоеЗначение = Ложь
	) Экспорт
	
	Перем ИспользоватьРасширеннуюАналитику;
	
	Если ПолучитьНовоеЗначение
	 ИЛИ Не ДополнительныеСвойства.Свойство("ИспользоватьРасширеннуюАналитику", ИспользоватьРасширеннуюАналитику)
	Тогда
		ИспользоватьРасширеннуюАналитику = глЗначениеПеременной("ИспользоватьРасширеннуюАналитикуУчетаНоменклатурыИЗатрат") 
			И (глЗначениеПеременной("ДатаНачалаИспользованияРасширеннойАналитикиУчетаНоменклатурыИЗатрат") <= ПериодРегистрации);
		ДополнительныеСвойства.Вставить("ИспользоватьРасширеннуюАналитику", ИспользоватьРасширеннуюАналитику);
	КонецЕсли;
	
	Возврат ИспользоватьРасширеннуюАналитику;
		
КонецФункции // ПолучитьИспользованиеРасширеннойАналитики()

// Функция получения режима использования расширенной аналитики учета.
//
// Параметры:
//	ПолучитьНовоеЗначение - Булево - признак необходимости получения нового значения параметра
//
// Возвращаемое значение:
//	Булево - признак использования расширенной аналитики учета
//
Функция ПолучитьРежимИспользованияРасширеннойАналитики(
	ПолучитьНовоеЗначение = Ложь
	) Экспорт
	
	Перем РежимИспользованияРасширеннойАналитики;
	
	Если ПолучитьНовоеЗначение
	 ИЛИ Не ДополнительныеСвойства.Свойство("РежимИспользованияРасширеннойАналитики", РежимИспользованияРасширеннойАналитики)
	Тогда
		РежимИспользованияРасширеннойАналитики = глЗначениеПеременной("РежимИспользованияРасширеннойАналитикиУчетаНоменклатурыИЗатрат");
		ДополнительныеСвойства.Вставить("РежимИспользованияРасширеннойАналитики", РежимИспользованияРасширеннойАналитики);
	КонецЕсли;
	
	Возврат РежимИспользованияРасширеннойАналитики;
		
КонецФункции // ПолучитьРежимИспользованияРасширеннойАналитики()


///////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ПОДГОТОВКИ ДАННЫХ ДЛЯ ПРОВЕДЕНИЯ ДОКУМЕНТА

// Процедура формирует структуру шапки документа и дополнительных полей.
//
// Параметры
//  СтруктураШапкиДокумента – Структура - Реквизиты документа "Расчет себестоимости выпуска"
//	Отказ - Булево - Признак отказа от проведения документа
//	Заголовок - Строка - Текст представления документа 
//
//
Процедура ПодготовитьСтруктуруШапкиДокумента(
	СтруктураШапкиДокумента, 
	Отказ, 
	Заголовок
	)
	
	// Период построения запросов
	мНачГраница = Новый Граница( НачалоМесяца(ПериодРегистрации), ВидГраницы.Включая);
	мКонГраница = Новый Граница( КонецМесяца(ПериодРегистрации), ВидГраницы.Включая);
	мНачДата    = НачалоМесяца(ПериодРегистрации);
	мКонДата    = КонецМесяца(ПериодРегистрации);
	
	ИспользоватьРасширеннуюАналитику = ПолучитьИспользованиеРасширеннойАналитики();
	
	Если ИспользоватьРасширеннуюАналитику Тогда
		// В режиме РА не используются параметры учетной политики
		// - мРасчетПоПеределамОсновноеПроизводство 
		// - мРасчетПоПеределамВспомогательноеПроизводство
		// Инициализируем булевые переменные.
		мРасчетПоПеределамОсновноеПроизводство        = Ложь;
		мРасчетПоПеределамВспомогательноеПроизводство = Ложь;
	Иначе
		Если мУчетнаяПолитика.СпособРасчетаСебестоимостиОсновногоПроизводства 
				= Перечисления.СпособыРасчетаСебестоимостиПродукции.ПоПодразделениям Тогда
			мРасчетПоПеределамОсновноеПроизводство = Ложь;
			
		ИначеЕсли мУчетнаяПолитика.СпособРасчетаСебестоимостиОсновногоПроизводства 
					= Перечисления.СпособыРасчетаСебестоимостиПродукции.ПоПеределам Тогда
			мРасчетПоПеределамОсновноеПроизводство = Истина;
			
		Иначе
			ОбщегоНазначения.СообщитьОбОшибке("Не указан параметр ""Способ расчета себестоимости основного производства"" учетной политики!", Отказ, Заголовок);
		КонецЕсли;
		
		Если мУчетнаяПолитика.СпособРасчетаСебестоимостиВспомогательногоПроизводства 
				= Перечисления.СпособыРасчетаСебестоимостиПродукции.ПоПодразделениям Тогда
			мРасчетПоПеределамВспомогательноеПроизводство = Ложь;
			
		ИначеЕсли мУчетнаяПолитика.СпособРасчетаСебестоимостиВспомогательногоПроизводства 
					= Перечисления.СпособыРасчетаСебестоимостиПродукции.ПоПеределам Тогда
			мРасчетПоПеределамВспомогательноеПроизводство = Истина;
			
		Иначе
			ОбщегоНазначения.СообщитьОбОшибке("Не указан параметр ""Способ расчета себестоимости вспомогательного производства"" учетной политики!", Отказ, Заголовок);
		КонецЕсли;
	КонецЕсли;
	
	ДетализацияКосвенныхЗатратВСебестоимости = мУчетнаяПолитика.ДетализацияКосвенныхЗатратВСебестоимости;
	ДетализацияПоФиксированнойСтатьеЗатрат = (ДетализацияКосвенныхЗатратВСебестоимости = Перечисления.ДетализацияКосвенныхЗатратВСебестоимости.ПоФиксированнойСтатьеЗатрат);
	
	СтатьяБракВПроизводстве 		  = мУчетнаяПолитика.СтатьяБракВПроизводстве;
	СтатьяОбщепроизводственныеРасходы = мУчетнаяПолитика.СтатьяОбщепроизводственныеРасходы;
	Если ОтражатьВУправленческомУчете Тогда
		СтатьяАдминистративныеРасходы = мУчетнаяПолитика.СтатьяАдминистративныеРасходы;
	Иначе
		СтатьяАдминистративныеРасходы = Справочники.СтатьиЗатрат.ПустаяСсылка();
	КонецЕсли;
	
	Если ОтражатьВУправленческомУчете Тогда
		ДиректКостингОбщепроизводственныеЗатраты = мУчетнаяПолитика["ДиректКостингОбщепроизводственныеЗатраты"];
		ДиректКостингАдминистративныеЗатраты     = мУчетнаяПолитика["ДиректКостингАдминистративныеЗатраты"];
	Иначе
		Если ОтражатьВБухгалтерскомУчете Тогда
			ДиректКостингОбщепроизводственныеЗатраты = мУчетнаяПолитика["НеРаспределятьОПЗнаСебестоимостьПродукции"];
		Иначе
			ДиректКостингОбщепроизводственныеЗатраты = Истина;	
		КонецЕсли; 
		ДиректКостингАдминистративныеЗатраты     = Истина;
	КонецЕсли;
	СтруктураШапкиДокумента.Вставить("ДиректКостингОбщепроизводственныеЗатраты", ДиректКостингОбщепроизводственныеЗатраты);
	СтруктураШапкиДокумента.Вставить("ДиректКостингАдминистративныеЗатраты",     ДиректКостингАдминистративныеЗатраты);
	
	Если ДетализацияПоФиксированнойСтатьеЗатрат Тогда
		Если НЕ ЗначениеЗаполнено(СтатьяБракВПроизводстве) Тогда
			ОбщегоНазначения.СообщитьОбОшибке("Не указан параметр ""Статья брак в производстве"" учетной политики!", Отказ, Заголовок);
		ИначеЕсли НЕ ЗначениеЗаполнено(СтатьяОбщепроизводственныеРасходы) И НЕ ДиректКостингОбщепроизводственныеЗатраты Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не указан параметр ""Статья общепроизводственных затрат"" учетной политики!", Отказ, Заголовок);
		
		ИначеЕсли НЕ ЗначениеЗаполнено(СтатьяАдминистративныеРасходы) И НЕ ДиректКостингАдминистративныеЗатраты Тогда
			ОбщегоНазначения.СообщитьОбОшибке("Не указан параметр ""Статья административных затрат"" учетной политики!", Отказ, Заголовок);
		КонецЕсли;
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат; // Прервать расчет
	КонецЕсли;

	мВидыПодразделенийДляРасчетаПоПеределам = Новый Массив;
	мВидыПодразделенийДляРасчетаПоПодразделениям = Новый Массив;
	Если мРасчетПоПеределамВспомогательноеПроизводство Тогда
		мВидыПодразделенийДляРасчетаПоПеределам.Добавить(Перечисления.ВидыПодразделений.ВспомогательноеПроизводство);
	Иначе
		мВидыПодразделенийДляРасчетаПоПодразделениям.Добавить(Перечисления.ВидыПодразделений.ВспомогательноеПроизводство);
	КонецЕсли;
	Если мРасчетПоПеределамОсновноеПроизводство Тогда
		мВидыПодразделенийДляРасчетаПоПеределам.Добавить(Перечисления.ВидыПодразделений.ОсновноеПроизводство);
	Иначе
		мВидыПодразделенийДляРасчетаПоПодразделениям.Добавить(Перечисления.ВидыПодразделений.ОсновноеПроизводство);
	КонецЕсли;
	
	УчетПоСредней = (мУчетнаяПолитика.СпособОценкиМПЗ = Перечисления.СпособыОценки.ПоСредней);
	СтруктураШапкиДокумента.Вставить("УчетПоСредней",        УчетПоСредней);
	СтруктураШапкиДокумента.Вставить("Ссылка",               Ссылка);
	СтруктураШапкиДокумента.Вставить("Дата",                 КонецМесяца(ПериодРегистрации));
	СтруктураШапкиДокумента.Вставить("Период",       		 КонецМесяца(ПериодРегистрации));
	СтруктураШапкиДокумента.Вставить("УчетнаяПолитика",      мУчетнаяПолитика);
	СтруктураШапкиДокумента.Вставить("ТабПеределовОбщая",    Неопределено);
	СтруктураШапкиДокумента.Вставить("СуффиксИмениРегистра", мСуффиксИмениРегистра);
	СтруктураШапкиДокумента.Вставить("ОтражатьВУправленческомУчете", ОтражатьВУправленческомУчете);
	СтруктураШапкиДокумента.Вставить("ОтражатьВБухгалтерскомУчете",  ОтражатьВБухгалтерскомУчете);
	СтруктураШапкиДокумента.Вставить("ОтражатьВМеждународномУчете",  ОтражатьВМеждународномУчете);
	СтруктураШапкиДокумента.Вставить("РасчетПоПеределамОсновноеПроизводство",        мРасчетПоПеределамОсновноеПроизводство);
	СтруктураШапкиДокумента.Вставить("РасчетПоПеределамВспомогательноеПроизводство", мРасчетПоПеределамВспомогательноеПроизводство);
	
	СтруктураШапкиДокумента.Вставить("ВидыПодразделенийДляРасчетаПоПеределам", 		 мВидыПодразделенийДляРасчетаПоПеределам);
	СтруктураШапкиДокумента.Вставить("ВидыПодразделенийДляРасчетаПоПодразделениям",  мВидыПодразделенийДляРасчетаПоПодразделениям);
	СтруктураШапкиДокумента.Вставить("мВидыПодразделенийДляРасчетаПоПеределам", 	 мВидыПодразделенийДляРасчетаПоПеределам);
	СтруктураШапкиДокумента.Вставить("мВидыПодразделенийДляРасчетаПоПодразделениям", мВидыПодразделенийДляРасчетаПоПодразделениям);
	
	СтруктураШапкиДокумента.Вставить("ДетализацияПоФиксированнойСтатьеЗатрат",  ДетализацияПоФиксированнойСтатьеЗатрат);
	Если ДетализацияПоФиксированнойСтатьеЗатрат Тогда
		СтруктураШапкиДокумента.Вставить("СтатьяОбщепроизводственныеРасходы", СтатьяОбщепроизводственныеРасходы);
		СтруктураШапкиДокумента.Вставить("СтатьяАдминистративныеРасходы",	  СтатьяАдминистративныеРасходы);
		СтруктураШапкиДокумента.Вставить("СтатьяБракВПроизводстве", 		  СтатьяБракВПроизводстве);
	Иначе
		СтруктураШапкиДокумента.Вставить("СтатьяОбщепроизводственныеРасходы");
		СтруктураШапкиДокумента.Вставить("СтатьяАдминистративныеРасходы");
		СтруктураШапкиДокумента.Вставить("СтатьяБракВПроизводстве");
	КонецЕсли;
	
	СтруктураШапкиДокумента.Вставить("ИтерационныйРасчетЗатратВстречногоВыпуска", мУчетнаяПолитика.ИспользоватьИтерационныйРасчетЗатратВстречногоВыпуска);
	
	СтруктураШапкиДокумента.Вставить("БезСтатейЗатрат",  Истина);
	
	СтруктураШапкиДокумента.Вставить("мСуффиксИмениРегистра", мСуффиксИмениРегистра);
	СтруктураШапкиДокумента.Вставить("мНачГраница", мНачГраница);
	СтруктураШапкиДокумента.Вставить("мКонГраница", мКонГраница);
	СтруктураШапкиДокумента.Вставить("мНачДата",  	мНачДата);
	СтруктураШапкиДокумента.Вставить("мКонДата",  	мКонДата);
	
	СтруктураШапкиДокумента.Вставить("РазрешитьКорректировкиИспользования", Ложь);
	
	Если СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда
		мУчетПоСредней_НУ 	= (мУчетнаяПолитика.СпособОценкиМПЗ = Перечисления.СпособыОценки.ПоСредней);
		мЕстьНалогНаПрибыль = (мУчетнаяПолитика.ЕстьНалогНаПрибыль = Истина);
		мЕстьНДС            = (мУчетнаяПолитика.ЕстьНДС            = Истина);
		СтруктураШапкиДокумента.Вставить("ЕстьНалогНаПрибыль", мЕстьНалогНаПрибыль);
		СтруктураШапкиДокумента.Вставить("ЕстьНДС"           , мЕстьНДС);
		СтруктураШапкиДокумента.Вставить("РазрешитьКорректировкиИспользования", мУчетнаяПолитика.ИспользоватьАвтоматическиеКорректировкиНалоговыхНазначенийПриРасчетеСебестоимости);
	КонецЕсли;
	
	СтруктураШапкиДокумента.Вставить("ВедениеУчетаПоПроектам", УправлениеПроектами.ВедениеУчетаПоПроектам());
	СтруктураШапкиДокумента.Вставить("ВедениеУчетаЗатратПоПроектам", УправлениеПроектами.ВедениеУчетаЗатратПоПроектам());
	
	СпособыВеденияПартионногоУчетаПоОрганизациям = УправлениеЗапасамиПартионныйУчет.ПодготовитьСоответствиеСпособыВеденияПартионногоУчетаПоОрганизациям(СтруктураШапкиДокумента);
	СтруктураШапкиДокумента.Вставить("СпособыВеденияПартионногоУчетаПоОрганизациям", СпособыВеденияПартионногоУчетаПоОрганизациям);

	ВидОтраженияВУчете = ПроцедурыРасчетаСебестоимостиВыпуска.ПолучитьВидОтраженияВУчете(СтруктураШапкиДокумента);
	СтруктураШапкиДокумента.Вставить("ВидОтраженияВУчете", ВидОтраженияВУчете);
	
	ИспользоватьРасширеннуюАналитику = ПолучитьИспользованиеРасширеннойАналитики();
	Если ОтражатьВМеждународномУчете Тогда
		СтруктураШапкиДокумента.Вставить("ИспользоватьРасширеннуюАналитику", Ложь);
	Иначе
		СтруктураШапкиДокумента.Вставить("ИспользоватьРасширеннуюАналитику", ИспользоватьРасширеннуюАналитику);
	КонецЕсли;
	
	РежимИспользованияРасширеннойАналитики = ПолучитьРежимИспользованияРасширеннойАналитики();
	СтруктураШапкиДокумента.Вставить("ОтражатьЗатратыВУпрУчете", (РежимИспользованияРасширеннойАналитики = Перечисления.РежимыИспользованияРасширеннойАналитики.УправленческийИРегламентированныйУчет));

	// По умолчанию "отладочный режим" выключен.
	//
	// Для его включения необходимо в режиме отладки выполнить функцию 
	// РасширеннаяАналитикаУчета.ВключитьОтладочныйРежим().
	//
	// Включение "отладочного режима" позволит просматривать данные временных таблиц - 
	// см. РасширеннаяАналитика.ПоказатьВременнуюТаблицу()
	РасширеннаяАналитикаУчета.ВключитьОтладочныйРежим(СтруктураШапкиДокумента, Истина);
	
КонецПроцедуры // ПодготовитьСтруктуруШапкиДокумента()

// Функция формирует структуру таблиц движений регистров.
//
// Параметры
//  СтруктураШапкиДокумента – Структура - Реквизиты документа "Расчет себестоимости выпуска"
//
// Возвращаемое значение:
//   Структура – Структура таблиц движений регистров
//
Функция ПолучитьСтруктуруТаблицДвиженийРегистров(
	СтруктураШапкиДокумента
	)
	
	// Наборы движений по регистрам
	Если СтруктураШапкиДокумента.ОтражатьВУправленческомУчете Тогда
		
		мСуффиксИмениРегистра             = "";
		
		мДвиженияВыпуск                   = Движения.ВыпускПродукции;
		мДвиженияЗатраты                  = Движения.Затраты;
		мДвиженияЗатратыОбороты           = Движения.ЗатратыОбороты;
		мДвиженияЗатратыНаВыпуск          = Движения.ЗатратыНаВыпускПродукции;
		мДвиженияЗатратыНаВыпускНаработка = Движения.ЗатратыНаВыпускПродукцииНаработка;
		мДвиженияБракВПроизводстве        = Движения.БракВПроизводстве;
		мДвиженияНЗП		              = Движения.НезавершенноеПроизводство;
		мДвиженияПартии			          = Движения.ПартииТоваровНаСкладах;
		мДвиженияПродажиСебестоимость	  = Движения.ПродажиСебестоимость;
		мДвиженияБазаРаспределенияЗатрат  = Движения.БазаРаспределенияЗатрат;
		
	ИначеЕсли СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда
		
		мСуффиксИмениРегистра             = "БухгалтерскийУчет";
		
		мДвиженияВыпуск                   = Движения.ВыпускПродукцииБухгалтерскийУчет;
		мДвиженияЗатраты                  = Движения.ЗатратыБухгалтерскийУчет;
		мДвиженияЗатратыНаВыпуск          = Движения.ЗатратыНаВыпускПродукцииБухгалтерскийУчет;
		мДвиженияЗатратыНаВыпускНаработка = Движения.ЗатратыНаВыпускПродукцииНаработкаБухгалтерскийУчет;
		мДвиженияБракВПроизводстве        = Движения.БракВПроизводствеБухгалтерскийУчет;
		мДвиженияНЗП		              = Движения.НезавершенноеПроизводствоБухгалтерскийУчет;
		мДвиженияПартии			          = Движения.ПартииТоваровНаСкладахБухгалтерскийУчет;
		мДвиженияБазаРаспределенияЗатрат  = Движения.БазаРаспределенияЗатратБухгалтерскийУчет;
		
		мДвиженияКорректировкиНЗП_НУ                = Движения.КорректировкиНезавершенноеПроизводствоНалоговыйУчет; 
		мДвиженияКорректировкиЗатраты_НУ            = Движения.КорректировкиЗатратыНалоговыйУчет; 
		мДвиженияКорректировкиБракВПроизводстве_НУ  = Движения.КорректировкиБракВПроизводствеНалоговыйУчет; 
		
		мОперация                         = Движения.Хозрасчетный;
		мСуффиксСчета                     = "СчетУчетаБУ";
		
	ИначеЕсли СтруктураШапкиДокумента.ОтражатьВМеждународномУчете Тогда
		
		мСуффиксИмениРегистра      = "МеждународныйУчет";
		
		мДвиженияВыпуск            = Движения.ВыпускПродукцииМеждународныйУчет;
		мДвиженияЗатраты           = Движения.ЗатратыМеждународныйУчет;
		мДвиженияЗатратыНаВыпуск   = Движения.ЗатратыНаВыпускПродукцииМеждународныйУчет;
		мДвиженияБракВПроизводстве = Движения.БракВПроизводствеМеждународныйУчет;
		мДвиженияНЗП		       = Движения.НезавершенноеПроизводствоМеждународныйУчет;
		мДвиженияПартии			   = Движения.ПартииТоваровНаСкладахМеждународныйУчет;
		мДвиженияБазаРаспределенияЗатрат  = Движения.БазаРаспределенияЗатратМеждународныйУчет;
		
		мОперация                  = Движения.Международный;
		мСуффиксСчета              = "СчетУчетаМСФО";
		
	КонецЕсли;
	
	мТаблицаДвиженийЗатратыНаВыпуск = мДвиженияЗатратыНаВыпуск.Выгрузить();
	мТаблицаДвиженийВыпуск			= мДвиженияВыпуск.Выгрузить();
	мТаблицаДвиженийНЗП				= мДвиженияНЗП.Выгрузить();
	мТаблицаДвиженийЗатраты			= мДвиженияЗатраты.Выгрузить();
	мТаблицаДвиженийБракВПроизводстве = мДвиженияБракВПроизводстве.Выгрузить();
	мТаблицаДвиженийПартии			= мДвиженияПартии.Выгрузить();
	
	Если ОтражатьВУправленческомУчете Тогда
		мТаблицаДвиженийЗатратыОбороты = мДвиженияЗатратыОбороты.Выгрузить();
		мТаблицаДвиженийПродажиСебестоимость = мДвиженияПродажиСебестоимость.Выгрузить();
	КонецЕсли;
	Если Не ОтражатьВМеждународномУчете Тогда
		мТаблицаДвиженийЗатратыНаВыпускНаработка = мДвиженияЗатратыНаВыпускНаработка.Выгрузить();
	КонецЕсли;
	
	СтруктураТаблицДвижений = Новый Структура;
	СтруктураТаблицДвижений.Вставить("ТаблицаДвиженийЗатратыНаВыпуск", 	мТаблицаДвиженийЗатратыНаВыпуск);
	СтруктураТаблицДвижений.Вставить("ТаблицаДвиженийВыпуск", 			мТаблицаДвиженийВыпуск);
	СтруктураТаблицДвижений.Вставить("ТаблицаДвиженийНЗП", 				мТаблицаДвиженийНЗП);
	СтруктураТаблицДвижений.Вставить("ТаблицаДвиженийЗатраты", 			мТаблицаДвиженийЗатраты);
	СтруктураТаблицДвижений.Вставить("ТаблицаДвиженийБракВПроизводстве",мТаблицаДвиженийБракВПроизводстве);
	СтруктураТаблицДвижений.Вставить("ТаблицаДвиженийПартии", 			мТаблицаДвиженийПартии);
	Если ОтражатьВУправленческомУчете Тогда
		СтруктураТаблицДвижений.Вставить("ТаблицаДвиженийЗатратыОбороты", 	мТаблицаДвиженийЗатратыОбороты);
		СтруктураТаблицДвижений.Вставить("ТаблицаДвиженийПродажиСебестоимость", мТаблицаДвиженийПродажиСебестоимость);
	КонецЕсли;
	Если Не ОтражатьВМеждународномУчете Тогда
		СтруктураТаблицДвижений.Вставить("ТаблицаДвиженийЗатратыНаВыпускНаработка", мТаблицаДвиженийЗатратыНаВыпускНаработка);
	КонецЕсли;
	
	Если ОтражатьВБухгалтерскомУчете Тогда
	
		мТаблицаДвиженийКорректировкиНЗП_НУ 				= мДвиженияКорректировкиНЗП_НУ.Выгрузить();
		мТаблицаДвиженийКорректировкиЗатраты_НУ 			= мДвиженияКорректировкиЗатраты_НУ.Выгрузить();
		мТаблицаДвиженийКорректировкиБракВПроизводстве_НУ	= мДвиженияКорректировкиБракВПроизводстве_НУ.Выгрузить();
		
		СтруктураТаблицДвижений.Вставить("ТаблицаДвиженийКорректировкиНЗП_НУ", 				мТаблицаДвиженийКорректировкиНЗП_НУ);
		СтруктураТаблицДвижений.Вставить("ТаблицаДвиженийКорректировкиЗатраты_НУ", 			мТаблицаДвиженийКорректировкиЗатраты_НУ);
		СтруктураТаблицДвижений.Вставить("ТаблицаДвиженийКорректировкиБракВПроизводстве_НУ",мТаблицаДвиженийКорректировкиБракВПроизводстве_НУ);
		
	КонецЕсли;		
	
	Возврат СтруктураТаблицДвижений;
	
КонецФункции // ПолучитьСтруктуруТаблицДвиженийРегистров()

///////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ВЫПОЛНЕНИЯ ЗАДАННЫХ В ДОКУМЕНТЕ ДЕЙСТВИЙ

// Процедура выполнения действия "Расчет базы распределения производственных расходов".
//
// Параметры
//  СтруктураШапкиДокумента – Структура - Реквизиты документа "Расчет себестоимости выпуска"
//	СтруктураТаблицДвижений - Структура - Структура таблиц движений по регистрам
//
Процедура ВыполняемоеДействиеРасчетБазыРаспределенияПроизводственныхРасходов(
	СтруктураШапкиДокумента,
	СтруктураТаблицДвижений
	)
	
	// Списание затрат по наработке.
	Если Не ОтражатьВМеждународномУчете Тогда
		ПроцедурыРасчетаСебестоимостиВыпуска.СписаниеЗатратНаВыпускНаработка(СтруктураШапкиДокумента);
	КонецЕсли;
	

	
	ПроцедурыРасчетаБазыРаспределенияЗатрат.РасчетБазыРаспределенияЗатрат(
		СтруктураШапкиДокумента,
		Ложь // КосвенныеЗатраты
	);
	
	
КонецПроцедуры // ВыполняемоеДействиеРасчетБазыРаспределенияПроизводственныхРасходов()

// Процедура выполнения действия "Расчет базы распределения производственных расходов".
//
// Параметры
//  СтруктураШапкиДокумента – Структура - Реквизиты документа "Расчет себестоимости выпуска"
//
Процедура ВыполняемоеДействиеРаспределениеПроизводственныхРасходов(
	СтруктураШапкиДокумента,
	СтруктураТаблицДвижений
	)
	
	ПроцедурыРасчетаСебестоимостиВыпуска.РаспределениеПрямыхПроизводственныхРасходов(СтруктураШапкиДокумента);
	
КонецПроцедуры // ВыполняемоеДействиеРасчетБазыРаспределенияПроизводственныхРасходов()

// Процедура выполнения действия "Распределение продукции и затрат по переделам".
//
// Параметры
//  СтруктураШапкиДокумента – Структура - Реквизиты документа "Расчет себестоимости выпуска"
//	СтруктураТаблицДвижений - Структура - Структура таблиц движений по регистрам
//
Процедура ВыполняемоеДействиеРаспределениеПродукцииИЗатратПоПеределам(
	СтруктураШапкиДокумента,
	СтруктураТаблицДвижений
	)
	
	// Списание затрат по наработке.
	Если Не ОтражатьВМеждународномУчете Тогда
		ПроцедурыРасчетаСебестоимостиВыпуска.СписаниеЗатратНаВыпускНаработка(СтруктураШапкиДокумента);
		
		
	КонецЕсли;
	
	РасчетСебестоимостиВыпускаРаспределениеПоПеределам.РаспределениеПродукцииИЗатратПоПеределам(СтруктураШапкиДокумента);
	
	ПроцедурыРасчетаСебестоимостиВыпуска.ПроверитьПрямыеЗатраты(СтруктураШапкиДокумента);
			
	ПроцедурыРасчетаСебестоимостиВыпуска.ЗаполнениеКорректировкиВстречногоВыпускаПродукции(СтруктураШапкиДокумента);
	
КонецПроцедуры // ВыполняемоеДействиеРаспределениеПродукцииИЗатратПоПеределам()

// Процедура выполнения действия "Расчет прямых затрат по подразделениям".
//
// Параметры
//  СтруктураШапкиДокумента – Структура - Реквизиты документа "Расчет себестоимости выпуска"
//	СтруктураТаблицДвижений - Структура - Структура таблиц движений по регистрам
//
Процедура ВыполняемоеДействиеРасчетПрямыхЗатратПоПодразделениям(
	СтруктураШапкиДокумента,
	СтруктураТаблицДвижений
	)
	
	ПроцедурыРасчетаСебестоимостиВыпуска.РасчетПрямыхЗатрат(СтруктураШапкиДокумента, СтруктураТаблицДвижений, Перечисления.СпособыРасчетаСебестоимостиПродукции.ПоПодразделениям);
			
	
КонецПроцедуры // ВыполняемоеДействиеРасчетПрямыхЗатратПоПодразделениям()

// Процедура выполнения действия "Расчет прямых затрат по переделам".
//
// Параметры
//  СтруктураШапкиДокумента – Структура - Реквизиты документа "Расчет себестоимости выпуска"
//	СтруктураТаблицДвижений - Структура - Структура таблиц движений по регистрам
//
Процедура ВыполняемоеДействиеРасчетПрямыхЗатратПоПеределам(
	СтруктураШапкиДокумента,
	СтруктураТаблицДвижений
	)
	
	ПроцедурыРасчетаСебестоимостиВыпуска.РасчетПрямыхЗатрат(
		СтруктураШапкиДокумента, 
		СтруктураТаблицДвижений, 
		Перечисления.СпособыРасчетаСебестоимостиПродукции.ПоПеределам
	);
	
КонецПроцедуры // ВыполняемоеДействиеРасчетПрямыхЗатратПоПеределам()

// Процедура выполнения действия "Определение продукции, исключаемой из базы распределения".
//
// Параметры
//  СтруктураШапкиДокумента – Структура - Реквизиты документа "Расчет себестоимости выпуска"
//
Процедура ВыполняемоеДействиеОпределениеПродукцииИсключаемойИзБазыРаспределения(
	СтруктураШапкиДокумента
	)
	
	ПроцедурыРасчетаСебестоимостиВыпуска.ОпределитьНоменклатуруИсключаемуюИзБазыРаспределения(СтруктураШапкиДокумента);
	ПроцедурыРасчетаСебестоимостиВыпуска.ОпределитьНоменклатуруСписаннуюНаРаспределяемыеЗатраты(СтруктураШапкиДокумента);
	
КонецПроцедуры // ВыполняемоеДействиеОпределениеПродукцииИсключаемойИзБазыРаспределения()

// Процедура выполнения действия "Расчет базы распределения косвенных расходов".
//
// Параметры
//  СтруктураШапкиДокумента – Структура - Реквизиты документа "Расчет себестоимости выпуска"
//
Процедура ВыполняемоеДействиеРасчетБазыРаспределенияКосвенныхРасходов(
	СтруктураШапкиДокумента
	)
	
	ПроцедурыРасчетаБазыРаспределенияЗатрат.РасчетБазыРаспределенияЗатрат(
		СтруктураШапкиДокумента,
		Истина // КосвенныеЗатраты
	);
		
КонецПроцедуры // ВыполняемоеДействиеРаспределениеКосвенныхРасходовПоПодразделениям()

// Процедура выполнения действия "Распределение косвенных расходов по подразделениям".
//
// Параметры
//  СтруктураШапкиДокумента – Структура - Реквизиты документа "Расчет себестоимости выпуска"
//	СтруктураТаблицДвижений - Структура - Структура таблиц движений по регистрам
//
Процедура ВыполняемоеДействиеРаспределениеКосвенныхРасходовПоПодразделениям(
	СтруктураШапкиДокумента,
	ДиректКостингОбщепроизводственныеЗатраты,
	СтруктураТаблицДвижений
	)
	
	ПроцедурыРасчетаСебестоимостиВыпуска.РаспределениеКосвенныхРасходов(
		СтруктураШапкиДокумента, 
		СтруктураТаблицДвижений, 
		ДиректКостингОбщепроизводственныеЗатраты, 
		Перечисления.СпособыРасчетаСебестоимостиПродукции.ПоПодразделениям
	);
		
КонецПроцедуры // ВыполняемоеДействиеРаспределениеКосвенныхРасходовПоПодразделениям()

// Процедура выполнения действия "Распределение косвенных расходов по переделам".
//
// Параметры
//  СтруктураШапкиДокумента – Структура - Реквизиты документа "Расчет себестоимости выпуска"
//	СтруктураТаблицДвижений - Структура - Структура таблиц движений по регистрам
//
Процедура ВыполняемоеДействиеРаспределениеКосвенныхРасходовПоПеределам(
	СтруктураШапкиДокумента,
	ДиректКостингОбщепроизводственныеЗатраты,
	СтруктураТаблицДвижений
	)
	
			
	ПроцедурыРасчетаСебестоимостиВыпуска.РаспределениеКосвенныхРасходов(
		СтруктураШапкиДокумента, 
		СтруктураТаблицДвижений, 
		ДиректКостингОбщепроизводственныеЗатраты, 
		Перечисления.СпособыРасчетаСебестоимостиПродукции.ПоПеределам
	);
		
КонецПроцедуры // ВыполняемоеДействиеРаспределениеКосвенныхРасходовПоПеределам()

// Процедура выполнения действия "Расчет затрат встречного выпуска по подразделениям".
//
// Параметры
//  СтруктураШапкиДокумента – Структура - Реквизиты документа "Расчет себестоимости выпуска"
//	СтруктураТаблицДвижений - Структура - Структура таблиц движений по регистрам
//
Процедура ВыполняемоеДействиеРасчетЗатратВстречногоВыпускаПоПодразделениям(
	СтруктураШапкиДокумента,
	СтруктураТаблицДвижений
	)
	
			
	ПроцедурыРасчетаСебестоимостиВыпуска.РасчетПрямыхЗатрат(
		СтруктураШапкиДокумента, 
		СтруктураТаблицДвижений, 
		Перечисления.СпособыРасчетаСебестоимостиПродукции.ПоПодразделениям, 
		Истина
		);
			
				
КонецПроцедуры // ВыполняемоеДействиеРасчетЗатратВстречногоВыпускаПоПодразделениям()

// Процедура выполнения действия "Расчет затрат встречного выпуска по переделам".
//
// Параметры
//  СтруктураШапкиДокумента – Структура - Реквизиты документа "Расчет себестоимости выпуска"
//	СтруктураТаблицДвижений - Структура - Структура таблиц движений по регистрам
//
Процедура ВыполняемоеДействиеРасчетЗатратВстречногоВыпускаПоПеределам(
	СтруктураШапкиДокумента,
	СтруктураТаблицДвижений
	)
	
			
	ПроцедурыРасчетаСебестоимостиВыпуска.РасчетПрямыхЗатрат(
		СтруктураШапкиДокумента, 
		СтруктураТаблицДвижений, 
		Перечисления.СпособыРасчетаСебестоимостиПродукции.ПоПеределам, 
		Истина
		);
			
КонецПроцедуры // ВыполняемоеДействиеРасчетЗатратВстречногоВыпускаПоПеределам()

// Процедура выполнения действия "Списание прочих затрат".
//
// Параметры
//  СтруктураШапкиДокумента – Структура - Реквизиты документа "Расчет себестоимости выпуска"
//
Процедура ВыполняемоеДействиеСписаниеПрочихЗатрат(
	СтруктураШапкиДокумента
	)
	
	ПроцедурыРасчетаСебестоимостиВыпуска.СписаниеЗатратДиректКостинг(
		СтруктураШапкиДокумента,
		Перечисления.ХарактерЗатрат.Прочие
	);
					
КонецПроцедуры // ВыполняемоеДействиеСписаниеПрочихЗатрат()

// Процедура выполнения действия "Распределение транспортно-заготовительных расходов".
//
// Параметры
//  СтруктураШапкиДокумента – Структура - Реквизиты документа "Расчет себестоимости выпуска"
//	СтруктураТаблицДвижений - Структура - Структура таблиц движений по регистрам
//
Процедура ВыполняемоеДействиеРаспределениеТранспортноЗаготовительныхРасходов(
	СтруктураШапкиДокумента,
	СтруктураТаблицДвижений
	)
	
	ПроцедурыРасчетаСебестоимостиВыпуска.РаспределениеВсехТранспортноЗаготовительныхРасходов(СтруктураШапкиДокумента);
	
КонецПроцедуры // ВыполняемоеДействиеРаспределениеТранспортноЗаготовительныхРасходов()

// Процедура выполнения действия "Списание общепроизводственных расходов по методу директ-костинг".
//
// Параметры
//  СтруктураШапкиДокумента – Структура - Реквизиты документа "Расчет себестоимости выпуска"
//
Процедура ВыполняемоеДействиеСписаниеОбщепроизводственныхРасходовПоМетодуДиректКостинг(
	СтруктураШапкиДокумента
	)
	
	ПроцедурыРасчетаСебестоимостиВыпуска.СписаниеЗатратДиректКостинг(
		СтруктураШапкиДокумента,
		Перечисления.ХарактерЗатрат.ОбщепроизводственныеРасходы
	);
			
КонецПроцедуры // ВыполняемоеДействиеСписаниеОбщепроизводственныхРасходовПоМетодуДиректКостинг()

// Процедура выполнения действия "Списание административных расходов по методу директ-костинг".
//
// Параметры
//  СтруктураШапкиДокумента – Структура - Реквизиты документа "Расчет себестоимости выпуска"
//
Процедура ВыполняемоеДействиеСписаниеАдминистративныхРасходовПоМетодуДиректКостинг(
	СтруктураШапкиДокумента
	)
	
	Если НЕ СтруктураШапкиДокумента.ДиректКостингАдминистративныеЗатраты Тогда
		ОбщегоНазначения.Сообщение("Действие ""Списание административных затрат по методу директ-костинг"" не будет выполнено, так как в учетной политике не установлен признак списания административных затрат на финансовый результат!", СтатусСообщения.Внимание);
		Возврат;
	КонецЕсли;
	
	ПроцедурыРасчетаСебестоимостиВыпуска.СписаниеЗатратДиректКостинг(
		СтруктураШапкиДокумента,
		Перечисления.ХарактерЗатрат.АдминистративныеРасходы
	);
			
КонецПроцедуры // ВыполняемоеДействиеСписаниеАдминистративныхРасходовПоМетодуДиректКостинг()

// Процедура выполнения действия "Списание расходов на сбыт".
//
// Параметры
//  СтруктураШапкиДокумента – Структура - Реквизиты документа "Расчет себестоимости выпуска"
//
Процедура ВыполняемоеДействиеСписаниеРасходовНаСбыт(
	СтруктураШапкиДокумента
	)
	
	ПроцедурыРасчетаСебестоимостиВыпуска.СписаниеЗатратДиректКостинг(
		СтруктураШапкиДокумента,
		Перечисления.ХарактерЗатрат.РасходыНаСбыт
	);
			
КонецПроцедуры // ВыполняемоеДействиеСписаниеРасходовНаСбыт()

// Процедура выполнения действия "Списание прочих операционных расходов".
//
// Параметры
//  СтруктураШапкиДокумента – Структура - Реквизиты документа "Расчет себестоимости выпуска"
//
Процедура ВыполняемоеДействиеСписаниеПрочихОперационныхРасходов(
	СтруктураШапкиДокумента
	)
	
	ПроцедурыРасчетаСебестоимостиВыпуска.СписаниеЗатратДиректКостинг(
		СтруктураШапкиДокумента,
		Перечисления.ХарактерЗатрат.ПрочиеОперационныеРасходы
	);
				
КонецПроцедуры // ВыполняемоеДействиеСписаниеПрочихОперационныхРасходов()

// Процедура осуществляет выполнение заданных в документе действий.
//
Процедура ВыполнениеДействийДокумента(
	СтруктураШапкиДокумента,
	СтруктураТаблицДвижений
	)
	
	Если ОтражатьВУправленческомУчете Тогда
		ДиректКостингОбщепроизводственныеЗатраты = мУчетнаяПолитика["ДиректКостингОбщепроизводственныеЗатраты"];
		ДиректКостингАдминистративныеЗатраты     = мУчетнаяПолитика["ДиректКостингАдминистративныеЗатраты"];
	Иначе
		ДиректКостингОбщепроизводственныеЗатраты = Истина;
		ДиректКостингАдминистративныеЗатраты     = Истина;
	КонецЕсли;
	
	Для Каждого СтрокаДействия Из ВыполняемыеДействия Цикл
		
		Если СтрокаДействия.ВыполняемоеДействие 
				= Перечисления.ВыполняемыеОперацииРасчетСебестоимостиВыпуска.РасчетБазыРаспределенияПроизводственныхРасходов Тогда
				
			ВыполняемоеДействиеРасчетБазыРаспределенияПроизводственныхРасходов(
				СтруктураШапкиДокумента,
				СтруктураТаблицДвижений
			);
				
		ИначеЕсли СтрокаДействия.ВыполняемоеДействие 
				= Перечисления.ВыполняемыеОперацииРасчетСебестоимостиВыпуска.РаспределениеТЗР Тогда
				
			ВыполняемоеДействиеРаспределениеТранспортноЗаготовительныхРасходов(
				СтруктураШапкиДокумента,
				СтруктураТаблицДвижений
			);
		
		ИначеЕсли СтрокаДействия.ВыполняемоеДействие 
				= Перечисления.ВыполняемыеОперацииРасчетСебестоимостиВыпуска.РаспределениеПроизводственныхРасходов Тогда
				
			ВыполняемоеДействиеРаспределениеПроизводственныхРасходов(
				СтруктураШапкиДокумента,
				СтруктураТаблицДвижений
			);
		
		ИначеЕсли СтрокаДействия.ВыполняемоеДействие 
				= Перечисления.ВыполняемыеОперацииРасчетСебестоимостиВыпуска.РаспределениеПродукцииИЗатратПоПеределам Тогда
				
			ВыполняемоеДействиеРаспределениеПродукцииИЗатратПоПеределам(
				СтруктураШапкиДокумента,
				СтруктураТаблицДвижений
			);
						
		ИначеЕсли СтрокаДействия.ВыполняемоеДействие 
				= Перечисления.ВыполняемыеОперацииРасчетСебестоимостиВыпуска.РасчетПрямыхЗатратПоПодразделениям Тогда
				
			ВыполняемоеДействиеРасчетПрямыхЗатратПоПодразделениям(
				СтруктураШапкиДокумента,
				СтруктураТаблицДвижений
			);
						
		ИначеЕсли СтрокаДействия.ВыполняемоеДействие 
				= Перечисления.ВыполняемыеОперацииРасчетСебестоимостиВыпуска.РасчетПрямыхЗатратПоПеределам Тогда
				
			ВыполняемоеДействиеРасчетПрямыхЗатратПоПеределам(
				СтруктураШапкиДокумента,
				СтруктураТаблицДвижений
			);
				
		ИначеЕсли СтрокаДействия.ВыполняемоеДействие 
				= Перечисления.ВыполняемыеОперацииРасчетСебестоимостиВыпуска.ОпределениеПродукцииИсключаемойИзБазыРаспределения Тогда
				
			ВыполняемоеДействиеОпределениеПродукцииИсключаемойИзБазыРаспределения(
				СтруктураШапкиДокумента
			);
				
		ИначеЕсли СтрокаДействия.ВыполняемоеДействие 
				= Перечисления.ВыполняемыеОперацииРасчетСебестоимостиВыпуска.РасчетБазыРаспределенияКосвенныхРасходов Тогда
				
			ВыполняемоеДействиеРасчетБазыРаспределенияКосвенныхРасходов(
				СтруктураШапкиДокумента
			);
				
		ИначеЕсли СтрокаДействия.ВыполняемоеДействие 
				= Перечисления.ВыполняемыеОперацииРасчетСебестоимостиВыпуска.РаспределениеКосвенныхРасходовПоПодразделениям Тогда
				
			ВыполняемоеДействиеРаспределениеКосвенныхРасходовПоПодразделениям(
				СтруктураШапкиДокумента,
				ДиректКостингОбщепроизводственныеЗатраты,
				СтруктураТаблицДвижений
				);
						
		ИначеЕсли СтрокаДействия.ВыполняемоеДействие 
				= Перечисления.ВыполняемыеОперацииРасчетСебестоимостиВыпуска.РаспределениеКосвенныхРасходовПоПеределам Тогда
				
			ВыполняемоеДействиеРаспределениеКосвенныхРасходовПоПеределам(
				СтруктураШапкиДокумента,
				ДиректКостингОбщепроизводственныеЗатраты,
				СтруктураТаблицДвижений
			);
				
		ИначеЕсли СтрокаДействия.ВыполняемоеДействие 
				= Перечисления.ВыполняемыеОперацииРасчетСебестоимостиВыпуска.СписаниеОбщепроизводственныхРасходовПоМетодуДиректКостинг Тогда
				
			ВыполняемоеДействиеСписаниеОбщепроизводственныхРасходовПоМетодуДиректКостинг(
				СтруктураШапкиДокумента
			);
				
			
		ИначеЕсли СтрокаДействия.ВыполняемоеДействие 
				= Перечисления.ВыполняемыеОперацииРасчетСебестоимостиВыпуска.СписаниеАдминистративныхРасходовПоМетодуДиректКостинг Тогда
				
			ВыполняемоеДействиеСписаниеАдминистративныхРасходовПоМетодуДиректКостинг(
				СтруктураШапкиДокумента
			);
						
		ИначеЕсли СтрокаДействия.ВыполняемоеДействие 
				= Перечисления.ВыполняемыеОперацииРасчетСебестоимостиВыпуска.СписаниеРасходовНаСбыт Тогда
				
			ВыполняемоеДействиеСписаниеРасходовНаСбыт(
				СтруктураШапкиДокумента
			);
						
		ИначеЕсли СтрокаДействия.ВыполняемоеДействие 
				= Перечисления.ВыполняемыеОперацииРасчетСебестоимостиВыпуска.СписаниеПрочихОперационныхРасходов Тогда
				
			ВыполняемоеДействиеСписаниеПрочихОперационныхРасходов(
				СтруктураШапкиДокумента
			);
				
		ИначеЕсли СтрокаДействия.ВыполняемоеДействие 
				= Перечисления.ВыполняемыеОперацииРасчетСебестоимостиВыпуска.РасчетЗатратВстречногоВыпускаПоПодразделениям Тогда
				
			ВыполняемоеДействиеРасчетЗатратВстречногоВыпускаПоПодразделениям(
				СтруктураШапкиДокумента,
				СтруктураТаблицДвижений
			);
						
		ИначеЕсли СтрокаДействия.ВыполняемоеДействие 
				= Перечисления.ВыполняемыеОперацииРасчетСебестоимостиВыпуска.РасчетЗатратВстречногоВыпускаПоПеределам Тогда
				
			ВыполняемоеДействиеРасчетЗатратВстречногоВыпускаПоПеределам(
				СтруктураШапкиДокумента,
				СтруктураТаблицДвижений
			);

			
		ИначеЕсли СтрокаДействия.ВыполняемоеДействие = Перечисления.ВыполняемыеОперацииРасчетСебестоимостиВыпуска.СписаниеПрочихЗатрат Тогда
			
			ВыполняемоеДействиеСписаниеПрочихЗатрат(
				СтруктураШапкиДокумента
			);
			
		ИначеЕсли СтрокаДействия.ВыполняемоеДействие = Перечисления.ВыполняемыеОперацииРасчетСебестоимостиВыпуска.СверткаДвиженийПоРегистрам Тогда
			
			ОбщегоНазначения.Сообщение("Сворачивание движений регистров...");
			ПроцедурыРасчетаСебестоимостиВыпуска.СвернутьДвиженияПоРегистрам(СтруктураШапкиДокумента);
			
		КонецЕсли;
		
	КонецЦикла;

	
КонецПроцедуры // ВыполнениеДействийДокумента()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

// Процедура - обработчик события "ОбработкаПроведения"
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения) Экспорт
	
	Если мУдалятьДвижения Тогда
		ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	КонецЕсли;
	
	// Сформируем структуру реквизитов шапки документа
	СтруктураШапкиДокумента = ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
	Заголовок = ОбщегоНазначения.ПредставлениеДокументаПриПроведении(Ссылка);
	
	// Документ должен принадлежать хотя бы к одному виду учета (управленческий, бухгалтерский, налоговый)
	Если Не ОтражатьВУправленческомУчете И Не ОтражатьВБухгалтерскомУчете И Не ОтражатьВМеждународномУчете Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Документ должен принадлежать хотя бы одному из видов учета: ""Управленческий"", ""Бухгалтерский"" или ""Международный"""".", Отказ, Заголовок);
	КонецЕсли;
	
	
	ПроверкаРеквизитов(Отказ, Заголовок, СтруктураШапкиДокумента);
	
	Если ОтражатьВУправленческомУчете Тогда
		мУчетнаяПолитика = ОбщегоНазначения.ПолучитьПараметрыУчетнойПолитикиУпр(КонецМесяца(ПериодРегистрации),истина);
	Иначе
		мУчетнаяПолитика = ОбщегоНазначения.ПолучитьПараметрыУчетнойПолитикиРегл(КонецМесяца(ПериодРегистрации), Организация,истина);
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(мУчетнаяПолитика) Тогда
		Отказ = Истина;
	КонецЕсли;
	
	ПроверитьСписокДействий(Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураТаблицДвижений = ПолучитьСтруктуруТаблицДвиженийРегистров(СтруктураШапкиДокумента);
	
	// Добавим дополнительные поля в структуру шапки документа.
	ПодготовитьСтруктуруШапкиДокумента(
		СтруктураШапкиДокумента,
		Отказ, 
		Заголовок
		);
		
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если СтруктураШапкиДокумента.ИспользоватьРасширеннуюАналитику Тогда
		
		
		Если ОтражатьВУправленческомУчете
		   И Не СтруктураШапкиДокумента.ОтражатьЗатратыВУпрУчете
		Тогда
			Возврат;
		КонецЕсли;
	
	КонецЕсли;
	
	ОбщегоНазначения.Сообщение(
		Заголовок,
		Перечисления.ВидыСообщений.Раздел,
		//Перечисления.ВидыСообщений.ВажнаяИнформация,
		, // Заголовок
		Ссылка
	);
	
	// Выполнение заданных в документе действий.
	Если СтруктураШапкиДокумента.ИспользоватьРасширеннуюАналитику Тогда
		
		ТаблицаОшибок = УправлениеЗатратами.СформироватьТаблицуОшибок();
		
		// Выполнение заданных в документе действий (на сервере)
		ПроцедурыРасчетаСебестоимостиРасширеннаяАналитика.ВыполнитьДействияДокумента(
			СтруктураШапкиДокумента, 
			ТаблицаОшибок);
			
		УправлениеЗатратами.ВывестиСообщенияОбОшибках(
			СтруктураШапкиДокумента,
			ТаблицаОшибок,
			"" // Заголовок
		);
		
	Иначе
		ВыполнениеДействийДокумента(
			СтруктураШапкиДокумента,
			СтруктураТаблицДвижений
			);
	КонецЕсли;
	
	ОбщегоНазначения.Сообщение(
		"Расчет себестоимости завершен!",
		Перечисления.ВидыСообщений.Раздел
	);
	
	// Зарегистрируем документ в последовательности.
	ЗарегистрироватьДокументВПоследовательностях(СтруктураШапкиДокумента);
	
КонецПроцедуры // ОбработкаПроведения()

// Процедура производит регистрацию документа в последовательностях партионного учета.
//
// Параметры
//  СтруктураШапкиДокумента – Структура – Реквизиты документа "Расчет себестоимости выпуска"
//
Процедура ЗарегистрироватьДокументВПоследовательностях(СтруктураШапкиДокумента)
	
	Если СтруктураШапкиДокумента.ОтражатьВУправленческомУчете Тогда
		
		ТаблицаОрганизаций = Новый ТаблицаЗначений;
		ТаблицаОрганизаций.Колонки.Добавить("Организация");
		
		СпособыВеденияПартионногоУчетаПоОрганизациям = СтруктураШапкиДокумента.СпособыВеденияПартионногоУчетаПоОрганизациям;
		Для Каждого Элемент Из СпособыВеденияПартионногоУчетаПоОрганизациям Цикл
			
			ОрганизацияУпр = УправлениеЗапасами.ПолучитьОрганизациюВСоответствииСоСпособомВеденияПартионногоУчетаПоОрганизациям(
				Элемент.Ключ, // Организация 
				Элемент.Значение // СпособВеденияПартионногоУчетаПоОрганизации
			);
			
			НоваяСтрока = ТаблицаОрганизаций.Добавить();
			НоваяСтрока.Организация = ОрганизацияУпр;
			
		КонецЦикла;
		
		ТаблицаОрганизаций.Свернуть("Организация", "");
		
		Для Каждого Строка Из ТаблицаОрганизаций Цикл
			
			ЗаписьРегистрации = ПринадлежностьПоследовательностям.ПартионныйУчет.Добавить();
			ЗаписьРегистрации.Период = КонецМесяца(ПериодРегистрации);
			ЗаписьРегистрации.Регистратор = Ссылка;
			ЗаписьРегистрации.Организация = Строка.Организация;
			
		КонецЦикла;
		
	ИначеЕсли СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда
		  
		УправлениеЗапасами.ЗарегистрироватьДокументВПоследовательностяхПартионногоУчета(
			ЭтотОбъект, 
			КонецМесяца(ПериодРегистрации), 
			СтруктураШапкиДокумента.Организация,
			Ложь, // ОтражатьВУправленческомУчете
			ОтражатьВБухгалтерскомУчете
		);
	КонецЕсли;
	
КонецПроцедуры // ЗарегистрироватьДокументВПоследовательностях()

// Процедура - обработчик события "ПередЗаписью"
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка  Тогда
		Возврат;
	КонецЕсли;
	
	Если ОтражатьВУправленческомУчете Тогда
		Организация = Неопределено;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ПериодРегистрации) Тогда
		ПериодРегистрации = НачалоМесяца(Дата);
	КонецЕсли;
	
	Если УправлениеЗапасами.ИспользуетсяРасширеннаяАналитикаУчета(ПериодРегистрации) Тогда
		ОтражатьВМеждународномУчете = Ложь;
	КонецЕсли;
	
	мУдалятьДвижения = НЕ ЭтоНовый();
	
КонецПроцедуры // ПередЗаписью()

// Процедура - обработчик события "ПриЗаписи"
//
Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка  Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПриЗаписи()

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	// Заполнить реквизиты значениями по умолчанию.
	Если НЕ ТипЗНЧ(ДанныеЗаполнения) = Тип("Структура") Тогда
		ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(ЭтотОбъект);
		ОтражатьВУправленческомУчете = Истина;
		ОтражатьВБухгалтерскомУчете  = Ложь;
		
		Если ВыполняемыеДействия.Количество() = 0 Тогда
			ЗаполнитьВыполняемыеДействия();
		КонецЕсли;
   КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	//Признак отражения в МУ должен быть установлен явно
	ОтражатьВМеждународномУчете = Ложь;
	ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(ЭтотОбъект,,ОбъектКопирования.Ссылка);
	ОтражатьВУправленческомУчете = Истина;
	ОтражатьВБухгалтерскомУчете  = Ложь;
	Организация = "";
КонецПроцедуры
